**Name: Mohammed Varaliya**

**Roll No: T109**

## Filtering, Sorting, and Grouping.

In [1]:
import pandas as pd
from sklearn.datasets import make_blobs
from sklearn.cluster import KMeans
features, _ = make_blobs(n_samples = 50,
n_features = 2,
centers = 3,
random_state = 1)
df = pd.DataFrame(features, columns=["feature_1", "feature_2"])
# make k-means clusterer
clusterer = KMeans(3, random_state=0)
# fit clusterer
clusterer. fit (features)
# predict values
df ['group'] = clusterer.predict(features)
df. head(10)

   feature_1  feature_2  group
0  -9.877554  -3.336145      2
1  -7.287210  -8.353986      0
2  -6.943061  -7.023744      0
3  -7.440167  -8.791959      0
4  -6.641388  -8.075888      0
5  -0.794152   2.104951      1
6  -2.760179   5.551214      1
7  -9.946905  -4.590344      2
8  -0.525790   3.306599      1
9  -1.981977   4.022436      1

In [18]:
import pandas as pd
df = pd.read_csv('practical 02\assets\Titanic-Dataset.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
# Filtering data based on a condition
print("\nFiltering data where Age is greater than 25:")
print(df.head()[df['Age'] > 25])

Filtering data where Age is greater than 25:
   PassengerId  Survived  Pclass  \
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

C:\Users\varal\AppData\Local\Temp\ipykernel_9652\2973115582.py:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  print(df.head()[df['Age'] > 25])

In [20]:
# Sorting the DataFrame by Age in descending order
print("\nSorting the DataFrame by Age in descending order:")
print(df.head().sort_values(by='Age', ascending=False))

Sorting the DataFrame by Age in descending order:
   PassengerId  Survived  Pclass  \
1            2         1       1
3            4         1       1
4            5         0       3
2            3         1       3
0            1         0       3

                                                Name     Sex   Age  SibSp  \
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
2                             Heikkinen, Miss. Laina  female  26.0      0
0                            Braund, Mr. Owen Harris    male  22.0      1

   Parch            Ticket     Fare Cabin Embarked
1      0          PC 17599  71.2833   C85        C
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
2      0  STON/O2. 3101282   7.9250   NaN        S
0      0         A/5 21171   7.2500   NaN        S

In [21]:
# Grouping and aggregating data
print("\nGrouping by 'Sex' and calculating the average age:")
print(df.groupby('Sex')['Age'].mean())

Grouping by 'Sex' and calculating the average age:
Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [22]:
print("\nUpdating the 'Age' column by doubling its values:")
df['Age'] = df['Age'] * 2
print(df.head())

Updating the 'Age' column by doubling its values:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  44.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  76.0      1
2                             Heikkinen, Miss. Laina  female  52.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  70.0      1
4                           Allen, Mr. William Henry    male  70.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [23]:
def age_half(age):
    return age / 2
df['Age'] = df['Age'].apply(age_half)
print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [24]:
# Replace
df ['Sex']. replace( ['female', 'male'], ['Woman', 'Man'] ).head (5)

0      Man
1    Woman
2    Woman
3    Woman
4      Man
Name: Sex, dtype: object

In [25]:
#Rename columns
df. rename(columns={'Pclass': 'Passenger Class'}).head(2)

,PassengerId,Survived,Passenger Class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [26]:
#prints unique values
print(df ['Sex'].unique())
#sum of each
df ['Sex'].value_counts()

['male' 'female']

Sex
male      577
female    314
Name: count, dtype: int64